# Напишите программу, на вход которой подаётся список чисел одной строкой.
# Программа должна для каждого элемента этого списка вывести сумму двух его соседей.
# Для элементов списка, являющихся крайними, одним из соседей считается элемент,
# находящий на противоположном конце этого списка. Например, если на вход подаётся список "1 3 5 6 10",
# то на выход ожидается список "13 6 9 15 7" (без кавычек).
#
# Если на вход пришло только одно число, надо вывести его же.
#
# Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.

x = input().split() #строка с числами разделенными пробелами на вход
if len(x) == 1:
    print(x[0])
elif len(x) > 1: # создаю новый список
    y = [int(x[i-1])+int(x[i+1]) for i in range (-1, len(x)-1)]
    for i in range(1, len(y)):
        print(y[i], end=' ') # вывожу значения со второго до последнего
    print(y[0]) # вывожу первое значение