# Напишите программу:

# Тимофей обычно спит ночью XX часов и устраивает себе днем тихий час на YY минут. Определите, сколько всего минут Тимофей спит в сутки.

# Внимание, программа принимает значения XX и YY из стандартного потока ввода (функция input),
# результат надо выводить в стандартный поток вывода (функция print). Обратите внимание на то, что приглашение,
# переданное в качестве аргумента в функцию input, считается выводом вашей программы. Используйте эту функцию без аргументов:

# values = input()  без строки приглашения!

X = int(input())
Y = int(input())
print(X * 60 + Y)